/* eslint-disable no-restricted-syntax,guard-for-in,quote-props */
// noinspection JSNonASCIINames,NonAsciiCharacters

const jsFunctionAnswersObject = {
  'Ответ на Вопрос 1 Функции -  верный': [true, 1],
  'Ответ на Вопрос 1 Функции - не верный': [false, 1],
  'Ответ на Вопрос 1 Функции - не верный ': [false, 1],
  'Ответ на Вопрос 2 Функции -  верный': [true, 2],
  'Ответ на Вопрос 2 Функции - не верный': [false, 2],
  'Ответ на Вопрос 2 Функции - не верный ': [false, 2],
  'Ответ на Вопрос 3 Функции -  верный': [true, 3],
  'Ответ на Вопрос 3 Функции - не верный': [false, 3],
  'Ответ на Вопрос 4 Функции - не верный': [false, 4],
  'Ответ на Вопрос 4 Функции -  верный': [true, 4],
  'Ответ на Вопрос 4 Функции - не верный ': [false, 4],
  'Ответ на Вопрос 5 Функции - не верный': [false, 5],
  'Ответ на Вопрос 5 Функции -  верный': [true, 5],
  'Ответ на Вопрос 5 Функции - не верный ': [false, 5],

};

module.exports = jsFunctionAnswersObject;
