export const sobesContent = [
  {
    tittle: 'Вопросы с собеседований JavaScript-разработчика',
    intro: 'В чем смысл оборачивания всего содержимого JavaScript-файла в функцию?...',
    description: `В чем смысл оборачивания всего содержимого JavaScript-файла в функцию?

Этот шаблон называется IIFE - Immediately Invoked Function Expression (немедленно вызываемое функциональное выражение). Этот подход позволяет:

обеспечить коду собственный блок видимости, то-есть контекст выполнения

избежать загрязнения глобальной области видимости глобальными переменными

избежать неумышленного переопределения уже существующих переменных в глобальной области видимости`,
    img: 'https://camo.githubusercontent.com/72f9cf233c611bcf7b2e97f14796386541f996622cc7d1f068994fe9f5f604b9/68747470733a2f2f6d69726f2e6d656469756d2e636f6d2f6d61782f3531322f312a5957617a684779476d4e73364b33485a45376c5337512e706e67',
  },
  {
    tittle: 'Каковы преимущества и недостатки монолитной и микросервисной архитектуры?',
    intro:
      'Явным преимуществом использования React является то, что он использует стиль функционального программирования.',
    description: `Интервьюер, вероятно, хочет увидеть, понимаете ли вы различия между ними и достаточно ли осведомлены о них, чтобы определить наиболее практичный подход в любой конкретной ситуации.
Ответ: Монолитные архитектуры обычно реализуются как приложение в виде единого компонента, что упрощает добавление задач, связанных со сквозной функциональностью (англ. сross-cutting concern), таких как: ограничение запросов, ведение журнала и различные функции безопасности. То есть к сквозной относится «вспомогательная» функциональность модуля, не относящаяся напрямую к выполняемой задаче, но необходимая. Поначалу такая архитектура может показаться более практичной, но по мере развития приложения становится все труднее поддерживать код или масштабировать его.

Стоит принимать во внимание, что микросервисы будут иметь широкий круг задач, связанных со сквозной функциональностью, которые не предполагались на этапе проектирования. В долгосрочной перспективе они, как правило, предпочтительнее из-за их автономной организации, что позволяет легко реструктурировать их по мере расширения или изменения их назначения.`,
    img: 'https://www.flaticon.com/premium-icon/icons/svg/789/789377.svg',
  },
  {
    tittle: 'Soft skills',
    intro: 'HR-менеджер, в отличие от технических специалистов...',
    description: `HR-менеджер, в отличие от технических специалистов, будет делать упор на ваши soft skills и задаст ряд общих вопросов. Так он поймет, есть ли у вас опыт работы в команде и готовы ли вы стать ее частью:

— Был ли у вас опыт менторинга и управления?

— Как взаимодействуете с командой?

— Как разрешали конфликтные ситуации?

— Как организовываете свое рабочее время?

— Готовы ли вы к жестким дедлайнам?

Скорее всего, рекрутер попросит привести примеры того, как вы справлялись со стрессовыми ситуациями на работе. Этот момент — время применить свои навыки сторителлинга.

`,
    img: 'https://profession-online.ru/mod_files/prof/img_img_prof_2.jpg',
  },
  {
    tittle: 'Лучшее время для собеседования',
    intro: 'Постарайтесь назначить встречу так, чтобы и вам, и рекрутеру...',
    description: `Постарайтесь назначить встречу так, чтобы и вам, и рекрутеру было удобно. Не стоит собеседоваться на бегу, впопыхах. Поверьте, ваша спешка и дискомфорт будут заметны опытному специалисту. Это будет означать, что вы в какую-то плотную систему своей жизни пытаетесь включить наш проект.

`,
    img: 'https://images-eu.ssl-images-amazon.com/images/I/41ElaDfAmdL.png',
  },
  {
    tittle: 'К каким вопросам рекрутера готовиться',
    intro: 'Во многом это зависит от политики компании...',
    description: `Во многом это зависит от политики компании. Есть разные стили проведения собеседований. Что бы у вас ни спрашивали, попытайтесь понять, почему или зачем рекрутёр спрашивает это.

Например, может быть вопрос, какую книгу недавно читал кандидат, какой курс или тренинг проходил, успешно ли закончил его? Какие возникали сложности, и что удалось понять из тренинга. Инициатива относительно самообразования многое говорит о человеке.`,
    img: 'https://pm1.narvii.com/7097/4563bff68144b65a88f71c5adae23460d7006146r1-608-608v2_00.jpg',
  },
  {
    tittle: 'Как себя позиционировать на собеседовании?',
    intro: 'Когда вас попросят рассказать о себе, не повторяйте...',
    description: `Когда вас попросят рассказать о себе, не повторяйте резюме. Рекрутер его уже прочитал. Расскажите, о чём вы мечтаете, чего хотите. Также о самом ключевом и важном из вашего опыта, и это должно коррелировать с запросом работодателя. Старайтесь говорить коротко и по существу, а не весь жизненный путь. Отразите вашу готовность к сотрудничеству.

Ошибка – просто представить какие-то свои уникальные сочетания качеств и «продать себя». Возможно, ваш набор характеристик не то, что нам нужно. Для понимания давайте сделаем сравнение с бытовой ситуацией. Например, мы хотим приобрести просто утюг или кофеварку, а нам предлагают мультиварку. Наши планы могут не совпадать. Из вашего красивого описания самого себя компания не сразу сможет понять, подходите ли вы под задачи, которые нужно будет решать.

Часто в резюме пишут о личностных качествах кандидата, например, о стрессоустойчивости. Вас вполне ожидаемо могут попросить привести пример из опыта, когда вы проявили это качество. Поэтому, если в вашем резюме есть список из характеристик, которые сложно чем-то подтвердить, заготовьте для каждой реальный мини-кейс или историю, которые продемонстрирует ваше соответствующее поведение.`,
    img: 'https://iphone-image.apkpure.com/v2/app/c/2/c/c2c09ef978c590d826eba70ec544718d.jpg',
  },
];
